---
kind: property
id: P:Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs.TypeId
source: html/233f75f8-96f5-abb0-8694-467106227b15.htm
---
# Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs.TypeId Property

The type id of the newly added external data instance id.

## Syntax (C#)
```csharp
public ElementId TypeId { get; }
```